// hw 4

// задача 1


// let i = 1;
// while (i <= 50) {
//     document.write(i + '<br>');
//     i++;
// }

// document.write('----------------------');


// let n = 38;
// while (n >= 5) {
//     document.write(n + ',  ');
//     n--;
// }

// ------------------------------------------------------------------------

// // задача 2

// let i = 89;
// while (i >= 11) {
//     document.write(i + '<br>');
//     i--;
// }

// ------------------------------------------------------------------------

// задача 3

// let i = 0;
// let sum = 0;
// for (i = 0; i <= 100; i++) {
//     console.log(i);
//     sum += i;
// }
// alert(sum);

// ------------------------------------------------------------------------

// задача 4 Найдите сумму чисел в каждом числе от 1 до 5, например: в числе 3 сумма составляет 6


// let i;
// let sum = 0;
// for (i = 0; i <= 5; i++) {
//     console.log(i)
//     sum += i;
// }
// alert(sum);

// ------------------------------------------------------------------------

// задача 5  Выведите чётные числа от 8 до 56 Решить задание через while и for.

// let i = 8
// while (i <= 56) {
//     document.write(i + ' ');
//     i++;
//     if (i % 2 == 0) {
//         console.log(i);
//     }
// }

// ------------------------------------------------------------------------

// задание 6
// for (let m1 = 2, s1 = 'x', s2 = '=', result; m1 <= 9; m1++) {
//     for (m2 = 1; m2 <= 9; m2++) {
//         result = m1 * m2;
//         document.write(m1 + s1 + m2 + s2 + result + '<br>');
//     }
//     document.write('<br>')
// }

// ------------------------------------------------------------------------
// задание7 



// for (n = 1000, num = 0; n > 50; n = n / 2, num++) {}
// console.log(n);
// console.log(num);


// let num = 0;
// let n = 1000;
// while (n > 50) {
//     n /= 2;
//     num++;
// }
// console.log(n);
// console.log(num);


// ------------------------------------------------------------------------
// // задание 8


// let sum = 0;
// let q = 0;
// let aver = 0;
// while (true) {
//     let value = prompt('введите число', '');
//     if (value == '' || value == 0 || value == false || value == null) {
//         break;
//     } else if (!isFinite(value)) {
//         alert('ошибка ввода');
//     } else {
//         sum += +value;
//         q++;
//         aver = sum / q;
//     }
// }
// console.log('сумма чисел : ' + sum);
// console.log('среднее арифметическое : ' + aver);